<template>
  <div class="bg-[#F9FCFF]">
    <div class="container-main main-padding flex flex-col gap-20">
      <h1 class="main-purple-text text-center">Преимущества работы с YouMi</h1>
      <div class="flex flex-col gap-28">
        <div
          v-for="(item, index) in items"
          :key="index"
          class="flex"
          :class="index % 2 !== 0 ? 'justify-end' : 'justify-start'"
        >
          <div
            class="flex flex-col items-start bg-[#FFFFFF] relative px-8 pb-10 border rounded-xl w-[65%] shadow-[8px_8px_0_#CDE1FF]"
          >
            <div class="w-32 h-32 -mt-16">
              <img
                :src="item.image"
                alt="image"
                class="w-full h-full object-contain"
              />
            </div>
            <div class="flex flex-col gap-2">
              <p class="text-black text-lg font-semibold">
                {{ item.title }}
              </p>
              <p class="text-[grey] text-sm font-normal">
                {{ item.tagline }}
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import earth from "@/assets/images/planet.svg";
import clock from "@/assets/images/watch.svg";
import rocket from "@/assets/images/rocket.svg";
import chat from "@/assets/images/chat.svg";
import light from "@/assets/images/light bulb.svg";

const items = [
  {
    image: earth,
    title: "Даем свободу выбора работать когда и где удобно",
    tagline:
      "Вам не нужно арендовать кабинет! Все сессии проходят онлайн, поэтому неважно, где находитесь вы и клиент, можно работать из любой точки мира. Вы можете самостоятельно корректировать свой график работы и выбирать количество клиентов, ориентируясь на себя.",
  },
  {
    image: clock,
    title: "Избавляем от рутины и поиска клиентов",
    tagline:
      "Еженедельно проводим супервизорские группы и интервизии. Их можно посещать в качестве докладчика и в качестве слушателя. Регулярно проводим вебинары с приглашенными экспертами из разных направлений психотерапии. Вы сможете участвовать в выборе спикеров или заявить о желании организовать свой вебинар Кураторы сервиса оказывают оперативную поддержку по этическим и любым другим вопросам, возникающим в процессе работы с клиентом.",
  },
  {
    image: rocket,
    title: "Развиваем и поддерживаем",
    tagline:
      "Еженедельно проводим супервизорские группы и интервизии. Их можно посещать в качестве докладчика и в качестве слушателя. Регулярно проводим вебинары с приглашенными экспертами из разных направлений психотерапии. Вы сможете участвовать в выборе спикеров или заявить о желании организовать свой вебинар. Кураторы сервиса оказывают оперативную поддержку по этическим и любым другим вопросам, возникающим в процессе работы с клиентом.",
  },
  {
    image: chat,
    title: "Профессиональное комьюнити",
    tagline:
      "YouMi — это не только комфортная работа, это сообщество профессионалов объединенных общей целью. Это мощный нетворкинг и возможность найти среди коллег новых друзей с общими интересам из разных городов и стран.",
  },
  {
    image: light,
    title: "Развиваем ваш личный бренд",
    tagline:
      "У нас есть свой блог и социальные сети. Наши психологи принимают активное участие в создании контента с указанием авторства. Это позволяет повышать вашу узнаваемость и медийность. Мы поощряем ваши творческие идеи по развитию сервиса и приветствуем вашу инициативу. За лучшие идеи и реализации мы дарим подарки и материальные вознаграждения.",
  },
];
</script>
